Catalogs/МИКО_мвРегистрируемыеСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>МИКО_мвРегистрируемыеСобытия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МИКО_мвВидыЗначимыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПоляОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/МИКО_мвВидыЗначимыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МИКО_мвВидыЗначимыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактВТечениеДня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/МИКО_мвРегистрируемыеСобытия/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидСобытия = Перечисления.МИКО_мвВидыЗначимыхСобытий.ВходящийЗвонок
	 Или ВидСобытия = Перечисления.МИКО_мвВидыЗначимыхСобытий.ИсходящийЗвонок Тогда
	
		УдаляемыйЭлемент = ПроверяемыеРеквизиты.Найти("ВидОбъекта");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйЭлемент);	
		КонецЕсли;
		
	ИначеЕсли ВидСобытия = Перечисления.МИКО_мвВидыЗначимыхСобытий.Справочник Тогда
	
		УдаляемыйЭлемент = ПроверяемыеРеквизиты.Найти("СрокДействия");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйЭлемент);	
		КонецЕсли;
	
	КонецЕсли; 
	
КонецПроцедуры
